{
  "backend/main.mo": "Main actor for the ICP backend implementing product CRUD, business info management, user profiles, and AI prompt history, with role-based access control for admin and user operations.",
  "backend/migration.mo": "Migration module that upgrades actor state from an older schema (without AI prompt history) to a new schema by adding an empty `aiPromptHistory` map.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (photo editor UI, editing tools, layer management, AI editing panel) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-line summaries of all frontend source files, describing their purpose and any notable fixes applied.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, sidebar, charts, and UI components.",
  "frontend/index.html": "HTML entry point for the BAJARANGI ENTERPRISES app with SEO meta tags, Open Graph social sharing tags, favicon, and the React root mount point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (home, products, admin, editor), wraps the app in AuthProvider and ThemeProvider, and renders a shared Layout with Header/Footer.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable AlertDialog component that prompts the user to confirm or cancel a destructive action, accepting title, message, and callback props.",
  "frontend/src/components/editor/AIEditPanel.tsx": "Panel that accepts a natural-language prompt, parses it into a transformation descriptor via a local utility, applies it to the canvas, and persists the prompt history to the backend.",
  "frontend/src/components/editor/CanvasWorkspace.tsx": "Canvas component that handles mouse/touch interactions for draw, crop, and shape tools, rendering a semi-transparent crop overlay with rule-of-thirds grid lines on a secondary overlay canvas.",
  "frontend/src/components/editor/EditorToolbar.tsx": "Top header toolbar component with upload, undo, redo, and download actions, including a hidden file input for image uploads and tooltip-wrapped buttons.",
  "frontend/src/components/editor/LayersPanel.tsx": "Displays a draggable list of canvas layers (text, shape, draw) with visibility toggle, delete, and reorder support via drag-and-drop.",
  "frontend/src/components/editor/PropertiesPanel.tsx": "Right-side panel that renders the appropriate tool settings component (filters, draw, text, shape, crop, resize, layers, AI edit) based on the active tool.",
  "frontend/src/components/editor/tools/CropTool.tsx": "Properties panel UI for the crop tool, showing the selected crop region's coordinates and dimensions with apply and cancel buttons.",
  "frontend/src/components/editor/tools/DrawTool.tsx": "Brush settings panel with a size slider, preset and custom color pickers, and a live preview circle reflecting current brush size and color.",
  "frontend/src/components/editor/tools/FilterTool.tsx": "Filter adjustment panel with sliders for brightness, contrast, saturation, blur, grayscale, sepia, hue rotation, and opacity, plus per-filter and global reset buttons.",
  "frontend/src/components/editor/tools/ResizeTool.tsx": "A React component that provides canvas resizing controls, including width/height inputs, an aspect ratio lock toggle, preset size buttons (HD, FHD, Square, etc.), and an apply button.",
  "frontend/src/components/editor/tools/ShapeTool.tsx": "A React component for configuring shape drawing settings, allowing users to select shape type (rectangle, circle, line, arrow), stroke width, stroke color, and fill color.",
  "frontend/src/components/editor/tools/TextTool.tsx": "A React component for configuring text tool settings including content, font family, font size, bold/italic toggles, text alignment, and color selection.",
  "frontend/src/components/editor/ToolsPanel.tsx": "Left-side vertical icon toolbar listing all available editor tools (select, crop, draw, text, shape, filter, resize, layers, AI edit) with tooltip labels.",
  "frontend/src/components/Footer.tsx": "Renders the site footer for BAJARANGI ENTERPRISES with a three-column layout containing branding, quick navigation links, and social media icons, plus a copyright line with a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, nav links (including Photo Editor), auth-aware login/logout and admin buttons, and a responsive mobile hamburger menu.",
  "frontend/src/components/ProductCard.tsx": "Card component displaying a product's image, name, price, and short description with buttons to call-to-order via phone or navigate to the product detail page.",
  "frontend/src/components/ProductFormModal.tsx": "Modal dialog form for creating or editing a product, with fields for name, price, descriptions, and image URL, wired to add/update mutation hooks.",
  "frontend/src/contexts/AuthContext.tsx": "Provides an authentication context using Internet Identity, exposing login/logout functions, authentication state, and admin status checked via the backend actor.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches a backend actor instance using the user's Internet Identity, initializing access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAIPrompts.ts": "Custom hooks for fetching all AI prompt history entries and saving new ones to the backend, using React Query for caching and mutation management.",
  "frontend/src/hooks/useCanvasEditor.ts": "A comprehensive custom hook managing canvas editor state including image data, drawing elements, filters, undo/redo history, tool settings, and canvas operations like upload, crop, and resize.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for CRUD operations on products and business info, wrapping backend actor calls with loading states and toast notifications.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining an agricultural green OKLCH color theme with light/dark mode CSS variables and custom utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Public About page that displays business info fetched from the backend alongside static 'Why Choose Us' feature cards with icons.",
  "frontend/src/pages/AdminBusinessInfo.tsx": "Admin-only page with a form to view and update business contact details and about text, redirecting unauthenticated or non-admin users to the home page.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page showing navigation cards to the product management and business info sections, with access guard redirecting unauthorized users.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing the product catalog, allowing authenticated admins to view, add, edit, and delete products via a table UI with a form modal and confirm dialog.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying business phone, email, and address info fetched from the API, along with a simple contact form that shows a success toast on submission.",
  "frontend/src/pages/Editor.tsx": "Image editor page that composes toolbar, tools panel, canvas workspace, and properties panel components, wiring them to the useCanvasEditor hook and adding keyboard shortcuts for undo/redo/delete.",
  "frontend/src/pages/Home.tsx": "Landing page with a hero banner, business name and tagline from the API, a 'View Products' CTA button, and a three-feature highlights section.",
  "frontend/src/pages/ProductDetail.tsx": "Detail page for a single product showing its image, price, and full description, with a 'Click to Call & Order' button that dials the business phone number.",
  "frontend/src/pages/Products.tsx": "Products listing page that fetches and displays all products in a responsive grid of ProductCard components, with a hero banner and empty/loading states.",
  "frontend/src/types/editor.ts": "Defines all TypeScript types and interfaces for the photo editor, including tool types, canvas elements (text, shape, draw), filter state, crop region, history entries, tool settings, and transformation descriptors.",
  "frontend/src/utils/canvasOperations.ts": "Provides canvas utility functions for applying CSS filters to a canvas, building filter strings from FilterState, and rendering canvas elements (text, shapes, freehand drawings).",
  "frontend/src/utils/promptParser.ts": "Parses natural language prompt strings into structured transformation descriptors, mapping keywords to filter changes (brightness, contrast, blur, etc.) and overlay effects (vignette, color tint, gradient).",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers for persisting values to sessionStorage and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom OKLCH-based color tokens (including sidebar, chart, and agricultural-green themes), custom border radii, fonts, and animation keyframes, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 3) for a Canva-like photo editor app, listing implemented features, architectural notes, image requirements, and known issues."
}