{
  "backend/main.mo": "Motoko actor implementing product catalog and business info management with admin authentication, CRUD operations for products, and business information updates.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including home, products, product detail, about, contact, and admin pages with their associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing, authentication, queries, components, pages, and styling for the agricultural products catalog application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining agricultural green theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Open Graph properties, and favicon references for BAJARANGI ENTERPRISES agricultural products site.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (home, products, about, contact, admin) wrapped in AuthProvider and ThemeProvider with shared Layout.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable AlertDialog component for confirming destructive actions with customizable title, message, and confirm/cancel handlers.",
  "frontend/src/components/Footer.tsx": "Footer component displaying business info, quick navigation links, social media icons, copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Navigation header component with mobile menu, authentication controls (login/logout), and admin settings link. Uses TanStack Router for navigation and displays the BAJARANGI ENTERPRISES logo and branding.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, price, short description, and action buttons for calling to order or viewing details. Handles image fallback and navigation to product detail pages.",
  "frontend/src/components/ProductFormModal.tsx": "Modal dialog form for adding or editing products with fields for name, price, descriptions, and image URL. Uses React Hook Form mutations and handles both create and update operations.",
  "frontend/src/contexts/AuthContext.tsx": "Authentication context provider that manages user authentication state, admin status checking via Internet Identity, and provides login/logout functions. Wraps the Internet Identity hook and actor for admin verification.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity integration hook and provider that manages authentication flow, identity storage, and login status. Creates AuthClient with configurable options and provides context for identity access throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including products (CRUD operations), business info retrieval and updates. Handles query invalidation, error handling, and success notifications via toast.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom agricultural green theme variables for light and dark modes, including color tokens for UI components and utility classes for agricultural-themed styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/About.tsx": "About page component displaying business information, mission statement, and four value propositions (Quality Products, Expert Service, Trusted Brand, etc.) with icons and descriptions.",
  "frontend/src/pages/AdminBusinessInfo.tsx": "Admin-only page for editing business information including name, contact phone, email, address, and about text with form validation and authentication checks.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard landing page with navigation cards to manage products and business information, protected by authentication and admin role checks.",
  "frontend/src/pages/AdminProducts.tsx": "Admin product management page with table view of all products, supporting add, edit, and delete operations through modals and confirmation dialogs.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying business contact information (phone, email, address) and a contact form that shows success toast on submission.",
  "frontend/src/pages/Home.tsx": "Home page component with agriculture-themed hero section displaying business name, description from backend, and a 'View Products' button. Includes three feature cards highlighting quality products, competitive prices, and easy ordering.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page showing large product image, full description, price, and a 'Click to Call' button that opens phone dialer with business contact number. Includes loading state and 'product not found' handling.",
  "frontend/src/pages/Products.tsx": "Products listing page with hero banner and responsive grid of product cards. Displays loading spinner while fetching data and shows empty state message when no products are available.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom agricultural theme colors (green, earth tones), extended design tokens for UI components (border, input, card, etc.), and custom animations using oklch color space.",
  "project_state.json": "Project metadata defining BAJARANGI ENTERPRISES as an agricultural products catalog website with admin CMS, call-to-order functionality (no payments), and specifications for required agriculture-themed images and existing features."
}